package ru.job4j.condition;

public class Bot {
    /**
     * Отвечает на вопросы.
     * @param question Вопрос от клиента.
     * @return Ответ.
     */
    public String answer(String question) {
        String rsl = "Я не понимаю, что ты говоришь!";
        if ("Привет, Бот.".equals(question)) {
            // заменить ... на правильный ответ rsl = "ответ по заданию".
            rsl = "Привет, умник.";
        } else if ("Пока.".equals(question)) { // заменить ... на проверку, что этот вопрос известен боту и он знает как на него ответить.
            // заменить ... на правильный ответ rsl = "ответ по заданию".
            rsl = "До скорой встречи.";
        }
        else if ("Сколько будет 2 + 2?".equals(question)) { // заменить ... на проверку, что этот вопрос известен боту и он знает как на него ответить.
        // заменить ... на правильный ответ rsl = "ответ по заданию".
        rsl = "Пусть калькулятор тебе посчитает!";
        }
        return rsl;
    }
}